; =========================================================================================
; ========================= added by Ray Twitty (aka Shadows) =============================
; =========================================================================================
; ====================================== START ============================================
; =========================================================================================
; фикс статика биографии во вкладке "Ранги"
CUICharacterInfo__InitCharacter_fix:
	; делаем свое
	; раскрасим текст
	push	255 ; B
	push	190 ; G
	push	190 ; R
	push	255 ; A
	mov     ecx, esi ; wnd
	call    CUIStatic__SetTextColor_script
	; SetTextComplexMode(true)
	push    1 ; bool
	mov     edi, esi ; wnd
	call	CUIStatic__SetTextComplexMode
	; делаем то что вырезали
	call    CUIStatic__AdjustHeightToText
	; возвращаемся
	jmp     back_from_CUICharacterInfo__InitCharacter_fix
; =========================================================================================
; ======================================= END =============================================
; =========================================================================================
