; =========================================================================================
; ========================= added by Ray Twitty (aka Shadows) =============================
; =========================================================================================
; ====================================== START ============================================
; =========================================================================================
; поддержка абсолютного hud_fov (требует расширения диапазона значений команды hud_fov и правку всех position у худа оружия)
; R_dsgraph_structure::r_dsgraph_render_hud()
; deg2rad(psHUD_FOV*Device.fFOV) -> deg2rad(psHUD_FOV<1.f ? psHUD_FOV*Device.fFOV : psHUD_FOV)

ORIG_HUD_FOV_LIMIT dd 1.0

absolute_hud_fov_support:
	movss	xmm0, dword ptr [ecx+1B4h]
	mov		ecx, ds:psHUD_FOV

	movss	xmm2, dword ptr [ecx]
	comiss	xmm2, ds:ORIG_HUD_FOV_LIMIT
	jbe		back_from_absolute_hud_fov_support
	; вместо Device.fFOV кладем 1.f
	fld1

	jmp		back_from_absolute_hud_fov_support
; =========================================================================================
; ======================================= END =============================================
; =========================================================================================
