; =========================================================================================
; ========================= added by Ray Twitty (aka Shadows) =============================
; =========================================================================================
; ====================================== START ============================================
; =========================================================================================
; поддержка абсолютного hud_fov (требует расширения диапазона значений команды hud_fov и правку всех position у худа оружия)
; R_dsgraph_structure::r_dsgraph_render_hud()
; deg2rad(psHUD_FOV*Device.fFOV) -> deg2rad(psHUD_FOV<1.f ? psHUD_FOV*Device.fFOV : psHUD_FOV)

ORIG_HUD_FOV_LIMIT dd 1.0

absolute_hud_fov_support:
	movss	xmm0, dword ptr [edx]
	comiss	xmm0, ds:ORIG_HUD_FOV_LIMIT
	ja		back_from_absolute_hud_fov_support
	; домножаем Device.fFOV если psHUD_FOV <= 1.0
	mulss	xmm0, dword ptr [eax+33Ch]

	jmp		back_from_absolute_hud_fov_support
; =========================================================================================
; ======================================= END =============================================
; =========================================================================================
